brianwyld/ble_nrf52_v2/src/main.c
/*
 * Copyright (c) 2016 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is confidential property of Nordic Semiconductor. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with Nordic Semiconductor.
 *
 */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"

#include "app_timer.h"
#include "app_error.h"
#include "app_uart.h"
#include "app_button.h"
#include "app_util.h"
#include "app_util_platform.h"

#include "boards.h"
#include "bsp_minew_nrf52.h"

#include "ble.h"
#include "ble_conn_params.h"
#include "ble_db_discovery.h"
#include "ble_gap.h"
#include "ble_nus.h"
#include "ble_hci.h"
#include "ble_gatts.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_delay.h"
#include "nrf_drv_gpiote.h"
#include "nrf_log.h"
#include "nrf_log_default_backends.h"
#include "nrf_log_ctrl.h"
#include "nrf_pwr_mgmt.h"

#include "timer_watchdog.h"

#include "wutils.h"
#include "main.h"
#include "comm_uart.h"
#include "comm_ble.h"
#include "device_config.h"

#include "ibs_scan.h"

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0   /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT              1   /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1   /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define NRF_BLE_MAX_MTU_SIZE    NRF_SDH_BLE_GATT_MAX_MTU_SIZE   /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#define APP_SOC_OBSERVER_PRIO           1                                           /**< Applications SOC event observer priority (must be <2) */
#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */
#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

// BW TODO seems like seeting to BLE_UUID_TYPE_VENDOR_BEGIN is not allowed any more for 16bit UUIDs (sd_uuid_encode fails with invalid type)
#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_BLE       //VENDOR_BEGIN      /**< UUID type for the Nordic UART Service (vendor specific). */
 
#define APP_ADV_INTERVAL_MS_SLOW        1000                                          /**< The advertising interval when not actively beaconing (in units of ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       60                                         /**< The advertising timeout (in units of seconds). */
 
#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */ 
 
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */
 
#define DEAD_BEEF 0xDEADBEEF                                    /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_TIMER_PRESCALER     0                               /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 2                               /**< Size of timer operation queues. */

#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS) /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                               /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Determines supervision time-out in units of 10 millisecond. */
 
//WBeacon
#define APP_BEACON_INFO_LENGTH          0x17                                    /**< Total length of information advertised by the Beacon. */
#define APP_CFG_NON_CONN_ADV_TIMEOUT    0                                   /**< Time for which the device must be advertising in non-connectable mode (in seconds). 0 disables timeout. */
#define APP_BEACON_ADV_DATA_LENGTH  (0x15)
#define APP_BEACON_ADV_DEVICE_TYPE (0x02)

static struct app_context {
    //UART Variables
    uint16_t                m_conn_handle;    /**< Handle of the current GAP connection. */
    // TODO we don't need to have a gatt server db unless acting as the central to talk to periphs? Takes up a lot of memory
//    ble_db_discovery_t      m_ble_db_discovery;             /**< Instance of database discovery module. Must be passed to all db_discovert API calls */
    // config
    uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH]; 
    bool flashBusy;
    bool resetRequested;
    ble_advertising_t adv_ctx;
    char advName[20];
    int8_t txPower;
} _ctx = {
    .m_conn_handle = BLE_CONN_HANDLE_INVALID, 
};

static void sys_evt_handler(uint32_t evt_id, void * p_context);
static void ble_evt_dispatch(const ble_evt_t * p_ble_evt, void* p_ctx);

// Register a handler for SOC events for flash busy/free
NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, sys_evt_handler, NULL);
// Register a handler for BLE events.
NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_dispatch, NULL);

static void advertising_init(ble_advertising_t* p_adv_ctx, int8_t* p_txPower);
static void advertising_update(ble_advertising_t* p_adv_ctx, int8_t* p_txPower);
static bool advertising_check_start();
static uint8_t makeAdvPowerLevel( void );

static void button1_event(uint8_t pin_no, uint8_t button_action);
static void button2_event(uint8_t pin_no, uint8_t button_action);
static void button3_event(uint8_t pin_no, uint8_t button_action);
static app_button_cfg_t button_cfgs[BUTTONS_NUMBER] = {
    { .pin_no = BUTTON_1, .active_state=APP_BUTTON_ACTIVE_HIGH, .pull_cfg=GPIO_PIN_CNF_PULL_Pulldown, .button_handler = button1_event },
    { .pin_no = BUTTON_2, .active_state=APP_BUTTON_ACTIVE_HIGH, .pull_cfg=GPIO_PIN_CNF_PULL_Pulldown, .button_handler = button2_event },
//    { .pin_no = BSP_BUTTON_3, .active_state=APP_BUTTON_ACTIVE_HIGH, .pull_cfg=GPIO_PIN_CNF_PULL_Pulldown, .button_handler = button3_event },
};

// debug startup helpers
static void init_stage(int s);
static bool _logs = false;
#undef APP_ERROR_CHECK
#define APP_ERROR_CHECK(d)  if (d!=NRF_SUCCESS) { if (_logs) { log_error("at %d in %s, error code %d", __LINE__, __FILE__, d); } else { init_stage(255);}}

//APP_TIMER_DEF(m_deinit_uart_delay); 

/**@brief Function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

typedef enum { INDICATE_IDLE, INDICATE_ADVERTISING, INDICATE_ADVERTISING_SLOW, INDICATE_CONNECTED } IND_e;

void led_indication(IND_e ind) {
    // TODO
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    led_indication(INDICATE_IDLE);
 
    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    uint32_t err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;
    log_info("evt:conn params evt %d", p_evt->evt_type);

