brianwyld/ble_nrf52_v2/src/main.c
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(_ctx.m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
        // We will get the BLE_GAP_EVT_DISCONNECTED event to restart advertising etc
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

 
/**@brief Function for handling events linked to our advertising.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            log_info("evt:advertsing FAST");
            // use leds if present to indicate state
            led_indication(INDICATE_ADVERTISING);
            break;
        case BLE_ADV_EVT_SLOW:
            log_info("evt:advertsing SLOW");
            // use leds if present to indicate state
            led_indication(INDICATE_ADVERTISING_SLOW);
            // if not being an ibeacon we are sending just NUS adverts
            break;
        case BLE_ADV_EVT_IDLE:
            log_info("evt:advertsing IDLE");
            // use leds if present to indicate state
            led_indication(INDICATE_IDLE);
        // BW : no sleeping on this job TODO check
//            sleep_mode_enter();
        break;
        default:
            log_info("evt:unprocessed advertsing evt %d", ble_adv_evt);
        break;
    }
}
  

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack event has
 *          been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 * @param[in] p_ctx application context for this handler - not used in this case
 */
static void ble_evt_dispatch(const ble_evt_t * p_ble_evt, void* p_ctx)
{
    log_info("ble event %d",p_ble_evt->header.evt_id);
    // First dispatch to other services to see if they need to process it
    // Dispatch to ble stack services if we want to be connected
    //ble_conn_params_on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt, &_ctx.adv_ctx);
    comm_ble_dispatch(p_ble_evt);           // For NUS service (we are slave)
//        comm_ble_c_dispatch(p_ble_evt);       // When discovering peers for NUS client connections

    // If we are scanning then make db of remote guys be up to date
//    ble_db_discovery_on_ble_evt(&_ctx.m_ble_db_discovery, p_ble_evt);

    // Now our own specific processing
    uint32_t err_code;
 
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            log_info("evt:gap connect");
            // Only allow the connection if we are configured to allow it and there is not already someone connected
            if (cfg_getConnectable() && _ctx.m_conn_handle==BLE_CONN_HANDLE_INVALID) {
                led_indication(INDICATE_CONNECTED);
                // Stop advertising, we only let 1 cnx at a time
                sd_ble_gap_adv_stop(_ctx.adv_ctx.adv_handle);
                _ctx.m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                // password check has not been validated for this connection
                cfg_resetPasswordOk();
            } else {
                // Not allowed to connect
                err_code = sd_ble_gap_disconnect(_ctx.m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
            }
        break; // BLE_GAP_EVT_CONNECTED
 
        case BLE_GAP_EVT_DISCONNECTED:
            log_info("evt:gap disconnect");
            led_indication(INDICATE_IDLE);
            _ctx.m_conn_handle = BLE_CONN_HANDLE_INVALID;
            // Restart advertising if required
            advertising_check_start();
        break; // BLE_GAP_EVT_DISCONNECTED
        
        case BLE_GAP_EVT_ADV_REPORT: {
            log_info("evt:adv rx");
            const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;

            // Reception of an advert - could be an ibeacon
            ibs_handle_advert(&p_gap_evt->params.adv_report);
        break; // BLE_GAP_EVT_ADV_REPORT
        }
        case BLE_GAP_EVT_TIMEOUT:
            log_info("evt:gap timeout");

            advertising_check_start();
            
            const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                // If scan still active, restart it
                if (ibs_is_scan_active())
                {
                    ibs_scan_restart();
                }
            }
        break;
            
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(_ctx.m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
        break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST
 
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(_ctx.m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_SYS_ATTR_MISSING
 
        case BLE_GATTC_EVT_TIMEOUT:
            log_info("evt:gattc timeout");
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            // And we get a EVT_DISCONNECTED when its done
        break; // BLE_GATTC_EVT_TIMEOUT
 
        case BLE_GATTS_EVT_TIMEOUT:
            log_info("evt:gatts timeout");
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            // And we get a EVT_DISCONNECTED when its done
            APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_TIMEOUT
 
        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
        break; // BLE_EVT_USER_MEM_REQUEST
 
        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;
 
            req = p_ble_evt->evt.gatts_evt.params.authorize_request;
 
            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
 
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
 
 
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        }
        break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST
 
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
        break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
 
        case BLE_GAP_EVT_ADV_SET_TERMINATED:
        {
            const ble_gap_evt_adv_set_terminated_t* p_adv_term = &p_ble_evt->evt.gap_evt.params.adv_set_terminated;
            if (p_adv_term->reason==BLE_GAP_EVT_ADV_SET_TERMINATED_REASON_TIMEOUT) {
                // restart it
                log_info("advertising restart");
                advertising_check_start();
            } else {
                log_info("advertising stopped due to %d", p_adv_term->reason);
            }
            break;
        }
        default:
            // No implementation needed.
        break;
    }
}

// Callback when system events happen
static void sys_evt_handler(uint32_t evt_id, void * p_context)
{
    log_info("SOC event %d", evt_id);

