brianwyld/ble_nrf52_v2/src/main.c
    memset(&ai, 0, sizeof(ai));

    ai.evt_handler = on_adv_evt;
    ai.error_handler = NULL;
    ai.advdata.name_type             = BLE_ADVDATA_FULL_NAME;
    ai.advdata.flags                 = (BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
    // Not connectable, no uuids advertised to avoid access to NUS
    ai.srdata.uuids_complete.uuid_cnt = 0;
    ai.srdata.uuids_complete.p_uuids  = NULL;
    ai.srdata.name_type = BLE_ADVDATA_FULL_NAME;
    ai.srdata.short_name_len = 8;      // get at least id part (maj/min in hex)
    ai.srdata.p_tx_power_level = p_txPower;

    // Give both options for advert speed (the one used depends on whether isIBeaconning() is true or not)
    ai.config.ble_adv_fast_enabled  = true;
    ai.config.ble_adv_fast_interval = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS);
    ai.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS*100;
    ai.config.ble_adv_slow_enabled = true;
    ai.config.ble_adv_slow_interval = MSEC_TO_UNITS(APP_ADV_INTERVAL_MS_SLOW, UNIT_0_625_MS);     //1285*1.6;
    ai.config.ble_adv_slow_timeout  = APP_ADV_TIMEOUT_IN_SECONDS*100;
     
    err_code = ble_advertising_init(p_adv_ctx, &ai);
    APP_ERROR_CHECK(err_code);
    ble_advertising_conn_cfg_tag_set(p_adv_ctx, APP_BLE_CONN_CFG_TAG);
}
 /**@brief Function for updateing the Advertising functionality params
 * call before each start of beaconning to update from config in case it changed
 */
static void advertising_update(ble_advertising_t* p_adv_ctx, int8_t* p_txPower)
{
    uint32_t               err_code;
    ble_advdata_t advdata;
    ble_advdata_t srdata;
    ble_advdata_manuf_data_t manuf_specific_data; 
    ble_uuid_t m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};     // Advertise NUS server for at commands over NUS

    memset(&advdata, 0, sizeof(advdata));
    memset(&srdata, 0, sizeof(srdata));

 
    // Build advertising data struct to pass into @ref ble_advertising_init.
    if (cfg_isIBeaconning()) {
        // Only make our advert look like an ibeacon if we are wanting it to be one
        manuf_specific_data.company_identifier = cfg_getCompanyID();
        // iBeacons are a BLE advert with a specific 'manufacteur specific' block, which is a TLV essentially
        _ctx.m_beacon_info[0] = APP_BEACON_ADV_DEVICE_TYPE;     // Tag - this is a ibeacon
        _ctx.m_beacon_info[1] = APP_BEACON_ADV_DATA_LENGTH;     // length of rest of block

        memcpy(&_ctx.m_beacon_info[2], cfg_getUUID(), UUID128_SIZE);
        _ctx.m_beacon_info[18] = MSB_16(cfg_getMajor_Value());
        _ctx.m_beacon_info[19] = LSB_16(cfg_getMajor_Value());
        _ctx.m_beacon_info[20] = MSB_16(cfg_getMinor_Value());
        _ctx.m_beacon_info[21] = LSB_16(cfg_getMinor_Value());    
        _ctx.m_beacon_info[22] = makeAdvPowerLevel();

        manuf_specific_data.data.p_data = (uint8_t *) (&_ctx.m_beacon_info[0]);
        manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

        advdata.name_type             = BLE_ADVDATA_NO_NAME;
        advdata.p_manuf_specific_data = &manuf_specific_data;
    } else {
        advdata.name_type             = BLE_ADVDATA_FULL_NAME;
        // And no addition manuf data so it doesn't look like an ibeacon
    }

    // depending on if we accept connections or not, advert data is different
    if (cfg_getConnectable()) {
        advdata.flags                 = (BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE |
                                        BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
        srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        srdata.uuids_complete.p_uuids  = m_adv_uuids;
    } else {
        advdata.flags                 = (BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
        // Not connectable, no uuids advertised to avoid access to NUS
        srdata.uuids_complete.uuid_cnt = 0;
        srdata.uuids_complete.p_uuids  = NULL;
    }
    srdata.name_type = BLE_ADVDATA_FULL_NAME;
    srdata.short_name_len = 8;      // get at least id part (maj/min in hex)
    srdata.p_tx_power_level = p_txPower;

    err_code = ble_advertising_advdata_update(p_adv_ctx, &advdata, &srdata);
    APP_ERROR_CHECK(err_code);
}
 


static bool advertising_check_start()
{
    uint32_t err_code;
    // Can't start if currently got an active BLE connection (not enough channels)
    if (_ctx.m_conn_handle!=BLE_CONN_HANDLE_INVALID) {
        return false;
    }
    // in all cases, setup to be ready otherwise the ble_advertisting_start() will fail with wrong state error
    // security - none, open adverts/scan connect
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    cfg_resetPasswordOk();
    // create context
    _ctx.txPower = cfg_getTXPOWER_Level();
    advertising_update(&_ctx.adv_ctx, &_ctx.txPower);
    // Change name
    char* advname = cfg_getAdvName();
    memset(_ctx.advName, 0, sizeof(_ctx.advName));
    strncpy(_ctx.advName, advname, sizeof(_ctx.advName)-1);
    sd_ble_gap_device_name_set(&sec_mode,
                            (const uint8_t *)_ctx.advName,
                                strlen(_ctx.advName));
    log_info("set advName to %s",_ctx.advName);

    // Change tx power level
    // NOT RUIRED? sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, _ctx.adv_ctx.adv_handle, cfg_getTXPOWER_Level());

    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((cfg_getConnectable() || ibb_isBeaconning())) // && ibs_is_scan_active()==false)
    {
        err_code = ble_advertising_start(&_ctx.adv_ctx, ibb_isBeaconning()?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
        APP_ERROR_CHECK(err_code);
        log_info("adv check : connectable [%s] beaconning : %s", cfg_getAdvName(), ibb_isBeaconning()?"yes":"no");
        return true;
    } else {
        //idle the adverts
        err_code = ble_advertising_start(&_ctx.adv_ctx, BLE_ADV_MODE_IDLE);
        APP_ERROR_CHECK(err_code);
        sd_ble_gap_adv_stop(_ctx.adv_ctx.adv_handle);
        log_info("adv check: no beaconning");
        return false;
    }
}
 


/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
    /* OLD
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
    */
}

// Control of beaconning activity
bool ibb_isBeaconning() {
    return (cfg_isIBeaconning());
}

void ibb_start() {
    cfg_setIsIBeaconning(true);
    // To change the beaconning, we have to stop anything currently running (connectable or ibeaconning)
    // TODO (the current phase will timeout in a while anyway and then we'll re-check it)
}
void ibb_stop() {
    cfg_setIsIBeaconning(false);
    // To change the beaconning, we have to stop anything currently running (connectable or ibeaconning)
    // TODO (the current phase will timeout in a while anyway and then we'll re-check it)
}

