brianwyld/ble_nrf52_v2/src/main.c
/** request a reset asap */
void app_reset_request() {
    _ctx.resetRequested = true;    
}

void app_setFlashBusy() {
    _ctx.flashBusy = true;      // someone somewhere is writing to the flash
}
void app_setFlashIdle() {
    _ctx.flashBusy = false;
}
bool app_isFlashBusy() {
    return _ctx.flashBusy;      // they would like to know if its busy right now
}

static void button1_event(uint8_t pin_no, uint8_t button_action) {
    if (button_action==APP_BUTTON_RELEASE) {
        // send event to main board
        // TODO
        bsp_board_led_invert(1);
    }
}

static void button2_event(uint8_t pin_no, uint8_t button_action) {
    if (button_action==APP_BUTTON_RELEASE) {
        // send event to main board
        // TODO
        bsp_board_led_invert(1);
    }

}
static void button3_event(uint8_t pin_no, uint8_t button_action) {
    if (button_action==APP_BUTTON_RELEASE) {
        // send event to main board
        // TODO
        bsp_board_led_invert(1);
    }

}

static void init_stage(int s) {
    switch(s) {
        case 0:
            for(int i=0;i<2;i++) {
                bsp_board_led_on(0);
                nrf_delay_ms(500);
                bsp_board_led_off(0);
                nrf_delay_ms(500);
            }
            break;
        case 1:
            bsp_board_led_on(0);
            bsp_board_led_off(1);
            nrf_delay_ms(1000);
            break;
        case 2:
            bsp_board_led_off(0);
            bsp_board_led_on(1);
            nrf_delay_ms(1000);
            break;
        case 3:
            bsp_board_led_on(0);
            bsp_board_led_on(1);
            nrf_delay_ms(1000);
            break;
        case 4:
            bsp_board_led_off(0);
            bsp_board_led_off(1);
            nrf_delay_ms(200);
            for(int i=0;i<5;i++) {
                bsp_board_led_on(1);
                nrf_delay_ms(200);
                bsp_board_led_off(1);
                nrf_delay_ms(200);
            }
            break;
        case 5:
            bsp_board_led_on(0);
            bsp_board_led_off(1);
            nrf_delay_ms(1000);
            break;
        case 6:
            bsp_board_led_off(0);
            bsp_board_led_on(1);
            nrf_delay_ms(1000);
            break;
        case 7:
            bsp_board_led_on(0);
            bsp_board_led_on(1);
            nrf_delay_ms(1000);
            break;
        case 255:
            while(true) {
                bsp_board_led_on(0);
                bsp_board_led_on(1);
                nrf_delay_ms(100);
                bsp_board_led_off(0);
                bsp_board_led_off(1);
                nrf_delay_ms(100);
            }
            break;
        default:
            for(int i=0;i<10;i++) {
                bsp_board_led_on(0);
                bsp_board_led_on(1);
                nrf_delay_ms(200);
                bsp_board_led_off(0);
                bsp_board_led_off(1);
                nrf_delay_ms(200);
            }
            break;

    }
}
int main(void)
{
    /* Configure board. */
    bsp_board_init(BSP_INIT_LEDS);
    init_stage(0);

    system_init();

    init_stage(1);

    // Init uart asap in case using for logs also
    comm_uart_init(); 

    init_stage(2);
#ifdef RELEASE_BUILD
    wlog_init(-1);      // replace by 0 to get logs on uart
#else 
    wlog_init(0);      // replace by 0 to get logs on uart - warning will disrupt remote guy if connected..
    _logs=true;
#endif

    log_error("STARTING");
    init_stage(3);

    cfg_init();              
    log_info("config/log init done");

    init_stage(4);
    
    ble_init();
    log_info("ble system init done");

    init_stage(5);

    // Tell host we are ready to rock
    comm_uart_tx((uint8_t *)"READY\r\n",7, NULL);
    // Init adv parameters and start if required
    advertising_check_start();
    log_info("advertising setup done");

    init_stage(6);

    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */

    log_info("waiting for commands");
    init_stage(7);

    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        // Check if flash needs updating
        cfg_writeCheck();
        // Check if UART has data to process
        comm_uart_processRX();
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
    }
}
